* How we prepared the artifact
** BenchExec
   #+BEGIN_SRC emacs-lisp :results output silent
   (require 'ob-sh)
   #+END_SRC

   First, we need to install BenchExec, which we use to run all the experiments.

   #+BEGIN_SRC sh  :results output silent
   wget https://github.com/sosy-lab/benchexec/releases/download/1.17/benchexec_1.17-1_all.deb 2>&1
   #+END_SRC

   #+BEGIN_SRC sh :results output silent
   echo ae | sudo -S apt-get install -y python3-tempita python3-yaml 2>&1
   echo ae | sudo -S dpkg -i benchexec_*.deb 2>&1
   #+END_SRC

   #+BEGIN_SRC sh :results output silent
   echo ae | sudo -S adduser cav benchexec
   #+END_SRC

   #+BEGIN_SRC sh :results none
   reboot
   #+END_SRC
** Solvers
   Now, we need to download and install all the solvers. First, we create a new directory:

   #+BEGIN_SRC sh :session solvers :results none
   mkdir solvers
   cd solvers
   #+END_SRC

*** Z3

    Create a new directory for Z3, download and unpack the official build for Ubuntu.

    #+BEGIN_SRC sh :session solvers :results output silent
    cd /home/cav/artifact/solvers
    mkdir Z3
    cd Z3
    wget https://github.com/Z3Prover/z3/releases/download/z3-4.8.4/z3-4.8.4.d6df51951f4c-x64-ubuntu-16.04.zip
    unzip z3-4.8.4.d6df51951f4c-x64-ubuntu-16.04.zip
    mv z3-4.8.4.d6df51951f4c-x64-ubuntu-16.04 z3
    #+END_SRC

    Test the Z3 binary:

    #+BEGIN_SRC sh :session solvers :results output verbatim
    z3/bin/z3 --version
    #+END_SRC

    #+RESULTS:
    : Z3 version 4.8.4 - 64 bit - build hashcode d6df51951f4c

    #+BEGIN_SRC sh :session solvers :results output silent
    echo ae | sudo -S cp z3/bin/libz3.{a,so} /usr/lib/
    echo ae | sudo -S cp z3/include/* /usr/include/
    #+END_SRC

    #+BEGIN_SRC sh :session solvers :results none
    cd ..
    #+END_SRC

*** Boolector

    Create a new directory for Boolector, download and unpack the official source codes.

    #+BEGIN_SRC sh :session solvers :results output silent
    cd /home/cav/artifact/solvers
    mkdir Boolector
    cd Boolector
    wget https://github.com/Boolector/boolector/archive/3.0.0.zip
    unzip 3.0.0.zip
    cd ..
    #+END_SRC

    We need to install cmake to build the solver.

    #+BEGIN_SRC sh :session solvers :results output silent
    wget https://github.com/Kitware/CMake/releases/download/v3.13.3/cmake-3.13.3-Linux-x86_64.tar.gz
    tar -xf cmake-3.13.3-Linux-x86_64.tar.gz
    echo ae | sudo -S cp -r cmake-3.13.3-Linux-x86_64/bin /usr/
    echo ae | sudo -S cp -r cmake-3.13.3-Linux-x86_64/share /usr/
    echo ae | sudo -S cp -r cmake-3.13.3-Linux-x86_64/doc /usr/share/
    echo ae | sudo -S cp -r cmake-3.13.3-Linux-x86_64/man /usr/share/
    echo ae | sudo -S rm -r cmake-3.13.3-Linux-x86_64
    echo ae | sudo -S rm cmake-3.13.3-Linux-x86_64.tar.gz
    echo ae | sudo -S apt-get install -y uuid-dev
    #+END_SRC

    Build the source codes.

    #+BEGIN_SRC sh :session solvers :results output silent
    cd Boolector/boolector-3.0.0
    ./contrib/setup-lingeling.sh
    ./contrib/setup-btor2tools.sh
    ./configure.sh && cd build && make
    #+END_SRC

    Test the Boolector binary:

    #+BEGIN_SRC sh :session solvers :results output
    bin/boolector --version
    #+END_SRC

    #+RESULTS:
    : 3.0.0

    #+BEGIN_SRC sh :session solvers :results none
    cd ../../..
    #+END_SRC

*** CVC4

    Create a new directory for CVC4, download the official build for Linux. Also, make the binary executable.

    #+BEGIN_SRC sh :session solvers :results output silent
    cd /home/cav/artifact/solvers
    mkdir CVC4
    cd CVC4
    wget https://cvc4.cs.stanford.edu/downloads/builds/x86_64-linux-opt/cvc4-1.6-x86_64-linux-opt
    mv cvc4-1.6-x86_64-linux-opt cvc4
    chmod a+x cvc4
    #+END_SRC

    Test the CVC4 binary:

    #+BEGIN_SRC sh :session solvers :results output verbatim
    ./cvc4 --version
    #+END_SRC

    #+RESULTS:
    #+begin_example
    This is CVC4 version 1.6
    compiled with GCC version 5.4.0 20160609
    on Jun 25 2018 14:35:28

    Copyright (c) 2009-2018 by the authors and their institutional
    affiliations listed at http://cvc4.cs.stanford.edu/authors

    CVC4 is open-source and is covered by the BSD license (modified).

    THIS SOFTWARE IS PROVIDED AS-IS, WITHOUT ANY WARRANTIES.
    USE AT YOUR OWN RISK.

    CVC4 incorporates code from ANTLR3 (http://www.antlr.org).
    See licenses/antlr3-LICENSE for copyright and licensing information.

    This version of CVC4 is linked against the following third party
    libraries covered by the LGPLv3 license.
    See licenses/lgpl-3.0.txt for more information.

      GMP - Gnu Multi Precision Arithmetic Library
      See http://gmplib.org for copyright information.

    See the file COPYING (distributed with the source code, and with
    all binaries) for the full CVC4 copyright, licensing, and (lack of)
    warranty information.
#+end_example

    #+BEGIN_SRC sh :session solvers :results none
    cd ..
    #+END_SRC

*** Q3B

    Create a new directory for Q3B, download the source codes from GitHub.

    #+BEGIN_SRC sh :session solvers :results output verbatim
    cd /home/cav/artifact/solvers
    mkdir Q3B
    cd Q3B
    git clone --recurse-submodules https://github.com/martinjonas/Q3B.git
    cd Q3B
    git checkout dev
    git submodule update --init --recursive
    cd ..
    #+END_SRC

    #+RESULTS:
    #+begin_example

    cav@cav19-artifact:~/artifact/solvers$ cav@cav19-artifact:~/artifact/solvers/Q3B$ Cloning into 'Q3B'...
    remote: Enumerating objects: 150, done.
    (1/150)           remote: Counting objects:   1% (2/150)           remote: Counting objects:   2% (3/150)           remote: Counting objects:   3% (5/150)           remote: Counting objects:   4% (6/150)           remote: Counting objects:   5% (8/150)           remote: Counting objects:   6% (9/150)           remote: Counting objects:   7% (11/150)           remote: Counting objects:   8% (12/150)           remote: Counting objects:   9% (14/150)           remote: Counting objects:  10% (15/150)           remote: Counting objects:  11% (17/150)           remote: Counting objects:  12% (18/150)           remote: Counting objects:  13% (20/150)           remote: Counting objects:  14% (21/150)           remote: Counting objects:  15% (23/150)           remote: Counting objects:  16% (24/150)           remote: Counting objects:  17% (26/150)           remote: Counting objects:  18% (27/150)           remote: Counting objects:  19% (29/150)           remote: Counting objects:  20% (30/150)           remote: Counting objects:  21% (32/150)           remote: Counting objects:  22% (33/150)           remote: Counting objects:  23% (35/150)           remote: Counting objects:  24% (36/150)           remote: Counting objects:  25% (38/150)           remote: Counting objects:  26% (39/150)           remote: Counting objects:  27% (41/150)           remote: Counting objects:  28% (42/150)           remote: Counting objects:  29% (44/150)           remote: Counting objects:  30% (45/150)           remote: Counting objects:  31% (47/150)           remote: Counting objects:  32% (48/150)           remote: Counting objects:  33% (50/150)           remote: Counting objects:  34% (51/150)           remote: Counting objects:  35% (53/150)           remote: Counting objects:  36% (54/150)           remote: Counting objects:  37% (56/150)           remote: Counting objects:  38% (57/150)           remote: Counting objects:  39% (59/150)           remote: Counting objects:  40% (60/150)           remote: Counting objects:  41% (62/150)           remote: Counting objects:  42% (63/150)           remote: Counting objects:  43% (65/150)           remote: Counting objects:  44% (66/150)           remote: Counting objects:  45% (68/150)           remote: Counting objects:  46% (69/150)           remote: Counting objects:  47% (71/150)           remote: Counting objects:  48% (72/150)           remote: Counting objects:  49% (74/150)           remote: Counting objects:  50% (75/150)           remote: Counting objects:  51% (77/150)           remote: Counting objects:  52% (78/150)           remote: Counting objects:  53% (80/150)           remote: Counting objects:  54% (81/150)           remote: Counting objects:  55% (83/150)           remote: Counting objects:  56% (84/150)           remote: Counting objects:  57% (86/150)           remote: Counting objects:  58% (87/150)           remote: Counting objects:  59% (89/150)           remote: Counting objects:  60% (90/150)           remote: Counting objects:  61% (92/150)           remote: Counting objects:  62% (93/150)           remote: Counting objects:  63% (95/150)           remote: Counting objects:  64% (96/150)           remote: Counting objects:  65% (98/150)           remote: Counting objects:  66% (99/150)           remote: Counting objects:  67% (101/150)           remote: Counting objects:  68% (102/150)           remote: Counting objects:  69% (104/150)           remote: Counting objects:  70% (105/150)           remote: Counting objects:  71% (107/150)           remote: Counting objects:  72% (108/150)           remote: Counting objects:  73% (110/150)           remote: Counting objects:  74% (111/150)           remote: Counting objects:  75% (113/150)           remote: Counting objects:  76% (114/150)           remote: Counting objects:  77% (116/150)           remote: Counting objects:  78% (117/150)           remote: Counting objects:  79% (119/150)           remote: Counting objects:  80% (120/150)           remote: Counting objects:  81% (122/150)           remote: Counting objects:  82% (123/150)           remote: Counting objects:  83% (125/150)           remote: Counting objects:  84% (126/150)           remote: Counting objects:  85% (128/150)           remote: Counting objects:  86% (129/150)           remote: Counting objects:  87% (131/150)           remote: Counting objects:  88% (132/150)           remote: Counting objects:  89% (134/150)           remote: Counting objects:  90% (135/150)           remote: Counting objects:  91% (137/150)           remote: Counting objects:  92% (138/150)           remote: Counting objects:  93% (140/150)           remote: Counting objects:  94% (141/150)           remote: Counting objects:  95% (143/150)           remote: Counting objects:  96% (144/150)           remote: Counting objects:  97% (146/150)           remote: Counting objects:  98% (147/150)           remote: Counting objects:  99% (149/150)           remote: Counting objects: 100% (150/150)           remote: Counting objects: 100% (150/150), done.
    (1/103)           remote: Compressing objects:   1% (2/103)           remote: Compressing objects:   2% (3/103)           remote: Compressing objects:   3% (4/103)           remote: Compressing objects:   4% (5/103)           remote: Compressing objects:   5% (6/103)           remote: Compressing objects:   6% (7/103)           remote: Compressing objects:   7% (8/103)           remote: Compressing objects:   8% (9/103)           remote: Compressing objects:   9% (10/103)           remote: Compressing objects:  10% (11/103)           remote: Compressing objects:  11% (12/103)           remote: Compressing objects:  12% (13/103)           remote: Compressing objects:  13% (14/103)           remote: Compressing objects:  14% (15/103)           remote: Compressing objects:  15% (16/103)           remote: Compressing objects:  16% (17/103)           remote: Compressing objects:  17% (18/103)           remote: Compressing objects:  18% (19/103)           remote: Compressing objects:  19% (20/103)           remote: Compressing objects:  20% (21/103)           remote: Compressing objects:  21% (22/103)           remote: Compressing objects:  22% (23/103)           remote: Compressing objects:  23% (24/103)           remote: Compressing objects:  24% (25/103)           remote: Compressing objects:  25% (26/103)           remote: Compressing objects:  26% (27/103)           remote: Compressing objects:  27% (28/103)           remote: Compressing objects:  28% (29/103)           remote: Compressing objects:  29% (30/103)           remote: Compressing objects:  30% (31/103)           remote: Compressing objects:  31% (32/103)           remote: Compressing objects:  32% (33/103)           remote: Compressing objects:  33% (34/103)           remote: Compressing objects:  34% (36/103)           remote: Compressing objects:  35% (37/103)           remote: Compressing objects:  36% (38/103)           remote: Compressing objects:  37% (39/103)           remote: Compressing objects:  38% (40/103)           remote: Compressing objects:  39% (41/103)           remote: Compressing objects:  40% (42/103)           remote: Compressing objects:  41% (43/103)           remote: Compressing objects:  42% (44/103)           remote: Compressing objects:  43% (45/103)           remote: Compressing objects:  44% (46/103)           remote: Compressing objects:  45% (47/103)           remote: Compressing objects:  46% (48/103)           remote: Compressing objects:  47% (49/103)           remote: Compressing objects:  48% (50/103)           remote: Compressing objects:  49% (51/103)           remote: Compressing objects:  50% (52/103)           remote: Compressing objects:  51% (53/103)           remote: Compressing objects:  52% (54/103)           remote: Compressing objects:  53% (55/103)           remote: Compressing objects:  54% (56/103)           remote: Compressing objects:  55% (57/103)           remote: Compressing objects:  56% (58/103)           remote: Compressing objects:  57% (59/103)           remote: Compressing objects:  58% (60/103)           remote: Compressing objects:  59% (61/103)           remote: Compressing objects:  60% (62/103)           remote: Compressing objects:  61% (63/103)           remote: Compressing objects:  62% (64/103)           remote: Compressing objects:  63% (65/103)           remote: Compressing objects:  64% (66/103)           remote: Compressing objects:  65% (67/103)           remote: Compressing objects:  66% (68/103)           remote: Compressing objects:  67% (70/103)           remote: Compressing objects:  68% (71/103)           remote: Compressing objects:  69% (72/103)           remote: Compressing objects:  70% (73/103)           remote: Compressing objects:  71% (74/103)           remote: Compressing objects:  72% (75/103)           remote: Compressing objects:  73% (76/103)           remote: Compressing objects:  74% (77/103)           remote: Compressing objects:  75% (78/103)           remote: Compressing objects:  76% (79/103)           remote: Compressing objects:  77% (80/103)           remote: Compressing objects:  78% (81/103)           remote: Compressing objects:  79% (82/103)           remote: Compressing objects:  80% (83/103)           remote: Compressing objects:  81% (84/103)           remote: Compressing objects:  82% (85/103)           remote: Compressing objects:  83% (86/103)           remote: Compressing objects:  84% (87/103)           remote: Compressing objects:  85% (88/103)           remote: Compressing objects:  86% (89/103)           remote: Compressing objects:  87% (90/103)           remote: Compressing objects:  88% (91/103)           remote: Compressing objects:  89% (92/103)           remote: Compressing objects:  90% (93/103)           remote: Compressing objects:  91% (94/103)           remote: Compressing objects:  92% (95/103)           remote: Compressing objects:  93% (96/103)           remote: Compressing objects:  94% (97/103)           remote: Compressing objects:  95% (98/103)           remote: Compressing objects:  96% (99/103)           remote: Compressing objects:  97% (100/103)           remote: Compressing objects:  98% (101/103)           remote: Compressing objects:  99% (102/103)           remote: Compressing objects: 100% (103/103)           remote: Compressing objects: 100% (103/103), done.
    (1/1941)   Receiving objects:   1% (20/1941)   Receiving objects:   2% (39/1941)   Receiving objects:   3% (59/1941)   Receiving objects:   4% (78/1941)   Receiving objects:   5% (98/1941)   Receiving objects:   6% (117/1941)   Receiving objects:   7% (136/1941)   Receiving objects:   8% (156/1941)   Receiving objects:   9% (175/1941)   Receiving objects:  10% (195/1941)   Receiving objects:  11% (214/1941)   Receiving objects:  12% (233/1941)   Receiving objects:  13% (253/1941)   Receiving objects:  14% (272/1941)   Receiving objects:  15% (292/1941)   Receiving objects:  16% (311/1941)   Receiving objects:  17% (330/1941)   Receiving objects:  18% (350/1941)   Receiving objects:  19% (369/1941)   Receiving objects:  20% (389/1941)   Receiving objects:  21% (408/1941)   Receiving objects:  22% (428/1941)   Receiving objects:  23% (447/1941)   Receiving objects:  24% (466/1941)   Receiving objects:  25% (486/1941)   Receiving objects:  26% (505/1941)   Receiving objects:  27% (525/1941)   Receiving objects:  28% (544/1941)   Receiving objects:  29% (563/1941)   Receiving objects:  30% (583/1941)   Receiving objects:  31% (602/1941)   Receiving objects:  32% (622/1941)   Receiving objects:  33% (641/1941)   Receiving objects:  34% (660/1941)   Receiving objects:  35% (680/1941)   Receiving objects:  36% (699/1941)   Receiving objects:  37% (719/1941)   Receiving objects:  38% (738/1941)   Receiving objects:  39% (757/1941)   Receiving objects:  40% (777/1941)   Receiving objects:  41% (796/1941)   Receiving objects:  42% (816/1941)   Receiving objects:  43% (835/1941)   Receiving objects:  44% (855/1941)   Receiving objects:  45% (874/1941)   Receiving objects:  46% (893/1941)   Receiving objects:  47% (913/1941)   Receiving objects:  48% (932/1941)   Receiving objects:  49% (952/1941)   Receiving objects:  50% (971/1941)   Receiving objects:  51% (990/1941)   Receiving objects:  52% (1010/1941)   Receiving objects:  53% (1029/1941)   Receiving objects:  54% (1049/1941)   Receiving objects:  55% (1068/1941)   Receiving objects:  56% (1087/1941)   Receiving objects:  57% (1107/1941)   Receiving objects:  58% (1126/1941)   Receiving objects:  59% (1146/1941)   Receiving objects:  60% (1165/1941)   Receiving objects:  61% (1185/1941)   Receiving objects:  62% (1204/1941)   Receiving objects:  63% (1223/1941)   Receiving objects:  64% (1243/1941)   Receiving objects:  65% (1262/1941)   Receiving objects:  66% (1282/1941)   Receiving objects:  67% (1301/1941)   Receiving objects:  68% (1320/1941)   Receiving objects:  69% (1340/1941)   Receiving objects:  70% (1359/1941)   Receiving objects:  71% (1379/1941)   Receiving objects:  72% (1398/1941)   Receiving objects:  73% (1417/1941)   Receiving objects:  74% (1437/1941)   Receiving objects:  75% (1456/1941)   Receiving objects:  76% (1476/1941)   Receiving objects:  77% (1495/1941)   Receiving objects:  78% (1514/1941)   Receiving objects:  79% (1534/1941)   Receiving objects:  80% (1553/1941)   Receiving objects:  81% (1573/1941)   Receiving objects:  82% (1592/1941)   Receiving objects:  83% (1612/1941)   Receiving objects:  84% (1631/1941)   Receiving objects:  85% (1650/1941)   Receiving objects:  86% (1670/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  87% (1689/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  88% (1709/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  89% (1728/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  90% (1747/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  91% (1767/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  92% (1786/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  93% (1806/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  94% (1825/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  95% (1844/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  96% (1864/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  97% (1883/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  98% (1903/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects:  99% (1922/1941), 924.01 KiB | 1.80 MiB/s   remote: Total 1941 (delta 66), reused 109 (delta 41), pack-reused 1791
    (1941/1941), 924.01 KiB | 1.80 MiB/s   Receiving objects: 100% (1941/1941), 1.38 MiB | 1.80 MiB/s, done.
    (0/1302)   Resolving deltas:   1% (20/1302)   Resolving deltas:   3% (47/1302)   Resolving deltas:   5% (67/1302)   Resolving deltas:   7% (92/1302)   Resolving deltas:  20% (262/1302)   Resolving deltas:  24% (314/1302)   Resolving deltas:  28% (365/1302)   Resolving deltas:  29% (388/1302)   Resolving deltas:  35% (462/1302)   Resolving deltas:  39% (512/1302)   Resolving deltas:  40% (524/1302)   Resolving deltas:  44% (574/1302)   Resolving deltas:  45% (590/1302)   Resolving deltas:  46% (600/1302)   Resolving deltas:  47% (617/1302)   Resolving deltas:  49% (647/1302)   Resolving deltas:  50% (651/1302)   Resolving deltas:  53% (694/1302)   Resolving deltas:  55% (720/1302)   Resolving deltas:  64% (837/1302)   Resolving deltas:  65% (849/1302)   Resolving deltas:  66% (862/1302)   Resolving deltas:  73% (952/1302)   Resolving deltas:  74% (969/1302)   Resolving deltas:  77% (1005/1302)   Resolving deltas:  82% (1074/1302)   Resolving deltas:  83% (1086/1302)   Resolving deltas:  84% (1102/1302)   Resolving deltas:  85% (1109/1302)   Resolving deltas:  86% (1132/1302)   Resolving deltas:  89% (1160/1302)   Resolving deltas:  90% (1180/1302)   Resolving deltas:  93% (1215/1302)   Resolving deltas:  94% (1234/1302)   Resolving deltas:  96% (1261/1302)   Resolving deltas:  97% (1273/1302)   Resolving deltas:  98% (1278/1302)   Resolving deltas:  99% (1290/1302)   Resolving deltas: 100% (1302/1302)   Resolving deltas: 100% (1302/1302), done.
    Checking connectivity... done.
    cav@cav19-artifact:~/artifact/solvers/Q3B/Q3B$ Branch dev set up to track remote branch dev from origin.
    Switched to a new branch 'dev'
    Submodule 'parser/smtlibv2-grammar' (https://github.com/martinjonas/smtlibv2-grammar.git) registered for path 'parser/smtlibv2-grammar'
    Cloning into 'parser/smtlibv2-grammar'...
    remote: Enumerating objects: 177, done.
    (1/177)   Receiving objects:   1% (2/177)   Receiving objects:   2% (4/177)   Receiving objects:   3% (6/177)   Receiving objects:   4% (8/177)   Receiving objects:   5% (9/177)   Receiving objects:   6% (11/177)   Receiving objects:   7% (13/177)   Receiving objects:   8% (15/177)   Receiving objects:   9% (16/177)   Receiving objects:  10% (18/177)   Receiving objects:  11% (20/177)   Receiving objects:  12% (22/177)   Receiving objects:  13% (24/177)   Receiving objects:  14% (25/177)   Receiving objects:  15% (27/177)   Receiving objects:  16% (29/177)   Receiving objects:  17% (31/177)   Receiving objects:  18% (32/177)   Receiving objects:  19% (34/177)   Receiving objects:  20% (36/177)   Receiving objects:  21% (38/177)   Receiving objects:  22% (39/177)   Receiving objects:  23% (41/177)   Receiving objects:  24% (43/177)   Receiving objects:  25% (45/177)   Receiving objects:  26% (47/177)   Receiving objects:  27% (48/177)   Receiving objects:  28% (50/177)   Receiving objects:  29% (52/177)   Receiving objects:  30% (54/177)   Receiving objects:  31% (55/177)   Receiving objects:  32% (57/177)   Receiving objects:  33% (59/177)   Receiving objects:  34% (61/177)   Receiving objects:  35% (62/177)   Receiving objects:  36% (64/177)   Receiving objects:  37% (66/177)   Receiving objects:  38% (68/177)   Receiving objects:  39% (70/177)   remote: Total 177 (delta 0), reused 0 (delta 0), pack-reused 177
    (71/177)   Receiving objects:  41% (73/177)   Receiving objects:  42% (75/177)   Receiving objects:  43% (77/177)   Receiving objects:  44% (78/177)   Receiving objects:  45% (80/177)   Receiving objects:  46% (82/177)   Receiving objects:  47% (84/177)   Receiving objects:  48% (85/177)   Receiving objects:  49% (87/177)   Receiving objects:  50% (89/177)   Receiving objects:  51% (91/177)   Receiving objects:  52% (93/177)   Receiving objects:  53% (94/177)   Receiving objects:  54% (96/177)   Receiving objects:  55% (98/177)   Receiving objects:  56% (100/177)   Receiving objects:  57% (101/177)   Receiving objects:  58% (103/177)   Receiving objects:  59% (105/177)   Receiving objects:  60% (107/177)   Receiving objects:  61% (108/177)   Receiving objects:  62% (110/177)   Receiving objects:  63% (112/177)   Receiving objects:  64% (114/177)   Receiving objects:  65% (116/177)   Receiving objects:  66% (117/177)   Receiving objects:  67% (119/177)   Receiving objects:  68% (121/177)   Receiving objects:  69% (123/177)   Receiving objects:  70% (124/177)   Receiving objects:  71% (126/177)   Receiving objects:  72% (128/177)   Receiving objects:  73% (130/177)   Receiving objects:  74% (131/177)   Receiving objects:  75% (133/177)   Receiving objects:  76% (135/177)   Receiving objects:  77% (137/177)   Receiving objects:  78% (139/177)   Receiving objects:  79% (140/177)   Receiving objects:  80% (142/177)   Receiving objects:  81% (144/177)   Receiving objects:  82% (146/177)   Receiving objects:  83% (147/177)   Receiving objects:  84% (149/177)   Receiving objects:  85% (151/177)   Receiving objects:  86% (153/177)   Receiving objects:  87% (154/177)   Receiving objects:  88% (156/177)   Receiving objects:  89% (158/177)   Receiving objects:  90% (160/177)   Receiving objects:  91% (162/177)   Receiving objects:  92% (163/177)   Receiving objects:  93% (165/177)   Receiving objects:  94% (167/177)   Receiving objects:  95% (169/177)   Receiving objects:  96% (170/177)   Receiving objects:  97% (172/177)   Receiving objects:  98% (174/177)   Receiving objects:  99% (176/177)   Receiving objects: 100% (177/177)   Receiving objects: 100% (177/177), 27.41 KiB | 0 bytes/s, done.
    (0/71)   Resolving deltas:   2% (2/71)   Resolving deltas:   4% (3/71)   Resolving deltas:  15% (11/71)   Resolving deltas:  19% (14/71)   Resolving deltas:  21% (15/71)   Resolving deltas:  22% (16/71)   Resolving deltas:  23% (17/71)   Resolving deltas:  28% (20/71)   Resolving deltas:  38% (27/71)   Resolving deltas:  39% (28/71)   Resolving deltas:  43% (31/71)   Resolving deltas:  45% (32/71)   Resolving deltas:  54% (39/71)   Resolving deltas:  73% (52/71)   Resolving deltas:  85% (61/71)   Resolving deltas:  88% (63/71)   Resolving deltas:  91% (65/71)   Resolving deltas:  95% (68/71)   Resolving deltas:  97% (69/71)   Resolving deltas:  98% (70/71)   Resolving deltas: 100% (71/71)   Resolving deltas: 100% (71/71), done.
    Checking connectivity... done.
    Submodule path 'parser/smtlibv2-grammar': checked out 'e228c33571b5b68ee558ffe29058a27ba66a0c67'
#+end_example

    We need to install autotools and automake to build CUDD. Also newer GCC to make Q3B.

    #+BEGIN_SRC sh :session solvers :results output silent
    echo ae | sudo -S add-apt-repository ppa:ubuntu-toolchain-r/test
    echo ae | sudo -S apt update
    echo ae | sudo -S apt-get install -y autotools-dev automake g++-7 2>&1
    echo ae | sudo -S update-alternatives --install /usr/bin/gcc gcc /usr/bin/gcc-7 60 \
                         --slave /usr/bin/g++ g++ /usr/bin/g++-7
    echo ae | sudo -S update-alternatives --config gcc
    #+END_SRC

    We also need to install CUDD:
    #+BEGIN_SRC sh :session solvers :results output silent
    git clone https://github.com/martinjonas/cudd.git
    cd cudd
    ./configure --enable-silent-rules --enable-obj --enable-shared && make -j4
    echo ae | sudo make install
    cd ..
    #+END_SRC

    Q3B also needs ANTLR, which, in turn needs Java:

    #+BEGIN_SRC sh :session solvers :results output silent
    echo ae | sudo -S wget https://www.antlr.org/download/antlr-4.7.2-complete.jar -P /usr/share/java
    echo ae | sudo -S apt-get install -y openjdk-9-jre-headless
    #+END_SRC

    Config git for ANTLR:

    #+BEGIN_SRC sh :session solvers :results output silent
    git config --global user.email "cav@cav"
    git config --global user.name "cav"
    #+END_SRC

    Now, create a build directory for Q3B and generate makefile with cmake.

    #+BEGIN_SRC sh :session solvers :results output verbatim
    cd /home/cav/artifact/solvers/Q3B/Q3B
    mkdir build
    cd build
    cmake .. -DANTLR_EXECUTABLE=/usr/share/java/antlr-4.7.2-complete.jar 2>&1
    #+END_SRC

    #+RESULTS:
    #+begin_example

    cav@cav19-artifact:~/artifact/solvers/Q3B/Q3B$ cav@cav19-artifact:~/artifact/solvers/Q3B/Q3B/build$ -- The C compiler identification is GNU 7.4.0
    -- The CXX compiler identification is GNU 7.4.0
    -- Check for working C compiler: /usr/bin/cc
    -- Check for working C compiler: /usr/bin/cc -- works
    -- Detecting C compiler ABI info
    -- Detecting C compiler ABI info - done
    -- Detecting C compile features
    -- Detecting C compile features - done
    -- Check for working CXX compiler: /usr/bin/c++
    -- Check for working CXX compiler: /usr/bin/c++ -- works
    -- Detecting CXX compiler ABI info
    -- Detecting CXX compiler ABI info - done
    -- Detecting CXX compile features
    -- Detecting CXX compile features - done
    -- No Build type specified; using RELEASE.
    -- Found OpenMP_C: -fopenmp (found version "4.5")
    -- Found OpenMP_CXX: -fopenmp (found version "4.5")
    -- Found OpenMP: TRUE (found version "4.5")
    -- Looking for pthread.h
    -- Looking for pthread.h - found
    -- Looking for pthread_create
    -- Looking for pthread_create - found
    -- Found Threads: TRUE
    -- Found ANTLR: /usr/share/java/antlr-4.7.2-complete.jar (found version "4.7.2")
    -- Configuring done
    -- Generating done
    -- Build files have been written to: /home/cav/artifact/solvers/Q3B/Q3B/build
#+end_example

    And, finally, build Q3B:

    #+BEGIN_SRC sh :session solvers :results output silent
    make -j4
    #+END_SRC

    Check the resulting binary:
    #+BEGIN_SRC sh :session solvers :results output verbatim
    ./q3b --version
    #+END_SRC

    #+RESULTS:
    : Q3B version 0.9 dev

    And run tests.

    #+BEGIN_SRC sh :session solvers :results output verbatim
    make test
    #+END_SRC

    #+RESULTS:
    #+begin_example
    Running tests...
    Test project /home/cav/artifact/solvers/Q3B/Q3B/build
	  Start  1: RegressionNoApprox
    1: RegressionNoApprox ...................   Passed    0.79 sec
	  Start  2: RegressionVariableApprox
    2: RegressionVariableApprox .............   Passed    1.63 sec
	  Start  3: RegressionBothLimitApprox
    3: RegressionBothLimitApprox ............   Passed    1.54 sec
	  Start  4: RegressionBothLimitApprox-TCI
    4: RegressionBothLimitApprox-TCI ........   Passed    0.00 sec
	  Start  5: RegressionOperationLimitApprox-ITE
    5: RegressionOperationLimitApprox-ITE ...   Passed    0.00 sec
	  Start  6: RegressionSMTCOMP2018
    6: RegressionSMTCOMP2018 ................   Passed    0.31 sec
	  Start  7: RegressionGoalUnconstrained
    7: RegressionGoalUnconstrained ..........   Passed    0.03 sec
	  Start  8: UnconstrainedBinaryTests
    8: UnconstrainedBinaryTests .............   Passed    0.12 sec
	  Start  9: UnconstrainedGoalUnconstrained
    9: UnconstrainedGoalUnconstrained .......   Passed    0.21 sec
	  Start 10: BinaryHelp
    10: BinaryHelp ...........................   Passed    0.00 sec
	  Start 11: BinaryVersion
    11: BinaryVersion ........................   Passed    0.00 sec
	  Start 12: Binary1
    12: Binary1 ..............................   Passed    0.01 sec
	  Start 13: Binary2
    13: Binary2 ..............................   Passed    0.17 sec
	  Start 14: Binary2Verbose
    14: Binary2Verbose .......................   Passed    0.17 sec
    tests passed, 0 tests failed out of 14

    Total Test time (real) =   5.00 sec
#+end_example

** Benchmarks
   We also need to download and unpack all quantified bit-vector
   benchmarks from the SMT-LIB repository.

   #+BEGIN_SRC sh :results output silent
   cd /home/cav/artifact
   mkdir benchmarks
   cd benchmarks
   wget http://smt-lib.loria.fr/zip/BV.zip
   unzip BV.zip
   rm BV.zip
   #+END_SRC

** R
   #+BEGIN_SRC sh :results output silent
   echo ae | sudo -S apt-get install -y r-base texlive
   echo ae | sudo -S apt-get install -y libssl-dev libxml2-dev libcurl4-openssl-dev
   #+END_SRC

   #+BEGIN_SRC sh :results output silent
   install.packages(c("tidyverse", "xtable"))
   #+END_SRC
